In [1]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

In [2]:
d = {'A':[78,4,5,85,9,92,9],'B':[78,4,5,85,9,92,9],'C':[78,4,5,85,9,92,9]}

In [3]:
df=pd.DataFrame(d)

In [4]:
df

    A   B   C
0  78  78  78
1   4   4   4
2   5   5   5
3  85  85  85
4   9   9   9
5  92  92  92
6   9   9   9

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       7 non-null      int64
 1   B       7 non-null      int64
 2   C       7 non-null      int64
dtypes: int64(3)
memory usage: 296.0 bytes

In [6]:
df.head()

    A   B   C
0  78  78  78
1   4   4   4
2   5   5   5
3  85  85  85
4   9   9   9

In [7]:
df.tail()

    A   B   C
2   5   5   5
3  85  85  85
4   9   9   9
5  92  92  92
6   9   9   9

In [8]:
df.mode()

   A  B  C
0  9  9  9

In [9]:
df.describe()

               A          B          C
count   7.000000   7.000000   7.000000
mean   40.285714  40.285714  40.285714
std    42.062312  42.062312  42.062312
min     4.000000   4.000000   4.000000
25%     7.000000   7.000000   7.000000
50%     9.000000   9.000000   9.000000
75%    81.500000  81.500000  81.500000
max    92.000000  92.000000  92.000000

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
     DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [10]:
data = {'A':[78,4,5,85,9,92,9],'B':[78,4,5,85,9,92,9],'C':[78,4,5,85,9,92,9]}

In [11]:
new_idx = pd.RangeIndex(start=1,stop=len(data['A'])*2,step=2)

In [12]:
df0 = pd.DataFrame(data,index=new_idx)

In [13]:
df0

     A   B   C
1   78  78  78
3    4   4   4
5    5   5   5
7   85  85  85
9    9   9   9
11  92  92  92
13   9   9   9

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
     iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
     function should print the sum to the console.

In [14]:
df = pd.DataFrame({'Values':[10,20,30,40,50]})

In [15]:
df

   Values
0      10
1      20
2      30
3      40
4      50

In [16]:
def Sum(colname):
    sum = 0
    for row in df[colname]:
        sum = sum + row
        if(row == 3):
            break
    return sum

In [17]:
Sum('Values')

150

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
    'Word_Count' that contains the number of words in each row of the 'Text' column.

In [18]:
data = {
    'Text':['hello hanzala','book','learn','mobile','bag']
}

In [19]:
df1 = pd.DataFrame(data)

In [20]:
count = df1['Text'].str.split()

In [21]:
count

0    [hello, hanzala]
1              [book]
2             [learn]
3            [mobile]
4               [bag]
Name: Text, dtype: object

In [22]:
df1['Word_count'] = count.apply(len)

In [23]:
df1

            Text  Word_count
0  hello hanzala           2
1           book           1
2          learn           1
3         mobile           1
4            bag           1

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [24]:
# DataFrame size gives the total number of elements present in the dataframe

In [25]:
# DataFrame shape gives the total numbers of rows and columns present in the dataframe

Q6. Which function of pandas do we use to read an excel file?

In [26]:
# pd.read_excel() is a method to read the excel file it takes the multiple parameter
# we have to pass the file name in string format

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [27]:
data = {'Email':['hanzala@gmail.com','jamila@gmail.com','shifas@gmail.com','ashfaque@gmail.com']}

In [28]:
df3 = pd.DataFrame(data)

In [29]:
df3

                Email
0   hanzala@gmail.com
1    jamila@gmail.com
2    shifas@gmail.com
3  ashfaque@gmail.com

In [30]:
df3['username']=df3['Email'].str.split("@").str[0]

In [31]:
df3

                Email  username
0   hanzala@gmail.com   hanzala
1    jamila@gmail.com    jamila
2    shifas@gmail.com    shifas
3  ashfaque@gmail.com  ashfaque

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [32]:
data = {'A':[3,8,6,2,9,],
        'B':[5,2,9,3,1,],
        'C':[1,7,4,5,2,]}

In [33]:
df4 = pd.DataFrame(data)

In [34]:
df4

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [35]:
df4[(df4['A'] > 5) & (df4['B'] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
     median, and standard deviation of the values in the 'Values' column.

In [36]:
df5 = pd.DataFrame({'Values':[10,10,10,20,5,7,30,30,40,50,9]})

In [37]:
df5

    Values
0       10
1       10
2       10
3       20
4        5
5        7
6       30
7       30
8       40
9       50
10       9

In [38]:
df5.mean()

Values    20.090909
dtype: float64

In [39]:
df5.median()

Values    10.0
dtype: float64

In [40]:
df5.mode()

   Values
0      10

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
      create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
      for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
     should include the current day.

In [41]:
import pandas as pd

# Creating a sample DataFrame
data = {'Date': pd.date_range(start='2023-07-01',periods=30),
        'Sales': [10, 15, 12, 18, 22, 17, 20, 25, 28, 30, 22, 20, 15, 10, 12, 18, 16, 20, 25, 28,30,21,43,21,22,33,43,12,9,10]}

df = pd.DataFrame(data,index=list(range(1,31)))

# Function to calculate moving average
def calculate_moving_average(row, window_size=7):
    if row.name < window_size - 1:
        return None  # Not enough data points for the moving average
    return df['Sales'].iloc[row.name - window_size + 1:row.name + 1].mean()

# Creating the 'MovingAverage' column
df['MovingAverage'] = df.apply(calculate_moving_average, axis=1)

In [42]:
df

         Date  Sales  MovingAverage
1  2023-07-01     10            NaN
2  2023-07-02     15            NaN
3  2023-07-03     12            NaN
4  2023-07-04     18            NaN
5  2023-07-05     22            NaN
6  2023-07-06     17      16.285714
7  2023-07-07     20      18.428571
8  2023-07-08     25      20.285714
9  2023-07-09     28      22.857143
10 2023-07-10     30      23.428571
11 2023-07-11     22      23.142857
12 2023-07-12     20      22.857143
13 2023-07-13     15      21.428571
14 2023-07-14     10      19.571429
15 2023-07-15     12      18.142857
16 2023-07-16     18      16.142857
17 2023-07-17     16      15.857143
18 2023-07-18     20      16.571429
19 2023-07-19     25      18.428571
20 2023-07-20     28      21.285714
21 2023-07-21     30      22.571429
22 2023-07-22     21      26.142857
23 2023-07-23     43      26.857143
24 2023-07-24     21      27.142857
25 2023-07-25     22      28.285714
26 2023-07-26     33      30.428571
27 2023-07-27     43      27.857143
28 2023-07-28     12      26.142857
29 2023-07-29      9      21.428571
30 2023-07-30     10      21.500000

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
      column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
      Monday, Tuesday) corresponding to each date in the 'Date' column.

In [43]:
data = {'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']}

In [44]:
df6 = pd.DataFrame(data)

In [45]:
df6['Date'] = pd.to_datetime(df6['Date'])

In [46]:
df6['Date'].dtypes

dtype('<M8[ns]')

In [47]:
df6['Weekday'] = df6['Date'].dt.day_name()

In [48]:
df6

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
     function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [49]:
start_date = '2023-01-01'
end_date = '2023-02-28'
date_range = pd.date_range(start=start_date, end=end_date, freq='D')

In [50]:
df7 = pd.DataFrame(date_range,columns=['Date'])

In [51]:
df7[(df7['Date'] >= '2023-01-01') & (df7['Date'] <= '2023-01-31')]

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
     be imported?

In [52]:
# To use basic function of pandas, The first thing we have to import is pandas library
# import pandas as pd
# where pd is an object name, one can write any name according to thier choice
# and if you are using first time pandas then you have to install pandas 
# pip install pandas